Revit 2024 API
IDirectContext3DServer Interface
 The interface to be implemented by a server of the DirectContext3D external service.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public interface IDirectContext3DServer : IExternalServer
Visual Basic
Public Interface IDirectContext3DServer _
	Inherits IExternalServer
Visual C++
public interface class IDirectContext3DServer : IExternalServer
See Also
IDirectContext3DServer Members
Autodesk.Revit.DB.DirectContext3D Namespace